In [90]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [91]:
train_df = pd.read_csv('data/train.csv')
test_df = pd.read_csv('data/test.csv')
combine = [train_df, test_df]

In [92]:
train_df0 = train_df.copy()

In [93]:
print('+++++++++++++++++++++++++++++++')
print('Train size:', train_df.shape)
print('Test size:', test_df.shape)
print('-------------------------------')
print('Train columns :', train_df.columns.values)
print('Test columns :', test_df.columns.values )
print('+++++++++++++++++++++++++++++++')

+++++++++++++++++++++++++++++++
Train size: (891, 12)
Test size: (418, 11)
-------------------------------
Train columns : ['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']
Test columns : ['PassengerId' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch' 'Ticket' 'Fare'
 'Cabin' 'Embarked']
+++++++++++++++++++++++++++++++

In [94]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [95]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [96]:
train_df['Survived'].value_counts() #데이터 개수를 세준다.

0    549
1    342
Name: Survived, dtype: int64

In [97]:
train_df['Survived'].value_counts() # 0은 죽은사람, 1은 산 사람이다

0    549
1    342
Name: Survived, dtype: int64

In [98]:
train_df.Survived.value_counts() #위와 같다

0    549
1    342
Name: Survived, dtype: int64

((342) / (342+549) )*100 = 생존율을 계산하고 싶은데, 저 값들을 어떻게 뽑아내는지 모르겠다.

In [99]:
train_df.Survived.value_counts()[0]

549

찾았당.. ㅋㅋ;

In [100]:
사망자 = train_df.Survived.value_counts()[0]
생존자 = train_df.Survived.value_counts()[1]


print('생존률: {}% '.format(round(((생존자 / (생존자+사망자) )*100),1))) # 소수 두번째 자리에서 반올림 : ", round(num, 1))

생존률: 38.4%

In [101]:
train_df.Pclass.value_counts() # Ticket class 1 = 1st, 2 = 2nd, 3 = 3rd

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [102]:
train_df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [103]:
train_df.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [104]:
np.sort(train_df.Age.unique())
# type(train_df.Age.unique()) #numpy.ndarray


# 어레이.sort() : 원본 배열의 값이 변경됨
# np.sort(어레이) : 정렬된 배열의 복사본 생성, 원본은 변경 없음

array([ 0.42,  0.67,  0.75,  0.83,  0.92,  1.  ,  2.  ,  3.  ,  4.  ,
        5.  ,  6.  ,  7.  ,  8.  ,  9.  , 10.  , 11.  , 12.  , 13.  ,
       14.  , 14.5 , 15.  , 16.  , 17.  , 18.  , 19.  , 20.  , 20.5 ,
       21.  , 22.  , 23.  , 23.5 , 24.  , 24.5 , 25.  , 26.  , 27.  ,
       28.  , 28.5 , 29.  , 30.  , 30.5 , 31.  , 32.  , 32.5 , 33.  ,
       34.  , 34.5 , 35.  , 36.  , 36.5 , 37.  , 38.  , 39.  , 40.  ,
       40.5 , 41.  , 42.  , 43.  , 44.  , 45.  , 45.5 , 46.  , 47.  ,
       48.  , 49.  , 50.  , 51.  , 52.  , 53.  , 54.  , 55.  , 55.5 ,
       56.  , 57.  , 58.  , 59.  , 60.  , 61.  , 62.  , 63.  , 64.  ,
       65.  , 66.  , 70.  , 70.5 , 71.  , 74.  , 80.  ,   nan])

In [105]:
# train_df.SibSp.unique() #array([1, 0, 3, 4, 2, 5, 8], dtype=int64)
train_df.SibSp.value_counts() # SibSp : 함께 탄 형제 자매, 또는 배우자

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

확인작업이 반복되는 것 같다. 함수를 만들어볼까?

In [106]:
def check(a):
    print(train_df.a.unique())
    print(train_df.a.value_counts())
    return

In [107]:
# check(Age)

간단한 함수 같은데 실행이 안된다 ^^; 정의되지 않은 변수라는 것 같다.. ㅠㅠ

In [108]:
train_df.Parch.unique() #array([0, 1, 2, 5, 3, 4, 6], dtype=int64)
train_df.Parch.value_counts() # Parch : 부모, 자식 수

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [109]:
# train_df.Ticket.unique()
train_df.Ticket.value_counts().head(10) #티켓 넘버

347082          7
CA. 2343        7
1601            7
3101295         6
CA 2144         6
347088          6
S.O.C. 14879    5
382652          5
LINE            4
PC 17757        4
Name: Ticket, dtype: int64

In [110]:
# train_df.Fare.unique()
train_df.Fare.value_counts() #요금

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
35.0000     1
28.5000     1
6.2375      1
14.0000     1
10.5167     1
Name: Fare, Length: 248, dtype: int64

In [111]:
# train_df.Cabin.unique()
train_df.Cabin.value_counts().head(10) #방 호수

B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
F2             3
E101           3
D              3
C78            2
C93            2
Name: Cabin, dtype: int64

In [112]:
# train_df.Embarked.unique() # array(['S', 'C', 'Q', nan], dtype=object)
train_df.Embarked.value_counts() #탑승지 C = 셰르부르, Q = 퀸즈타운, S = 사우샘프턴

S    644
C    168
Q     77
Name: Embarked, dtype: int64

NAN 값 확인하자

In [113]:
# train_df.info() #총 데이터 개수는 891
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### 데이터 전처리

변수 제거

In [114]:
# train_df = train_df.drop(['PassengerId','Name','Ticket', 'Fare', 'Cabin'], axis=1)
# PassengerId 인덱스 수준이라 제거
# Name 이름으로 특징을 설명할 수 없기에 제거
# Ticket은 제거 안하고 싶다. 나름 장소 대신 사용할 수 없을까?
# Fare 운임도 뭐 나쁘지 않은듯 
# Cabin 방 호수는 결측치가 너무 많다.. 살리지 못할 것 같다.. ㅠㅠ (살려봐?)

train_df = train_df.drop(['PassengerId','Name','Cabin'], axis=1)

print(train_df.columns)

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Embarked'],
      dtype='object')

결측치 채우기

In [117]:
#결측치 행 인덱스 찾기

train_df['Embarked'][train_df['Embarked'].isnull()]

61     NaN
829    NaN
Name: Embarked, dtype: object

In [120]:
train_df.loc[61]

Survived         1
Pclass           1
Sex         female
Age           38.0
SibSp            0
Parch            0
Ticket      113572
Fare          80.0
Embarked       NaN
Name: 61, dtype: object

In [122]:
train_df.loc[61, 'Embarked'] = 'S'

In [123]:
train_df.loc[829]

Survived         1
Pclass           1
Sex         female
Age           62.0
SibSp            0
Parch            0
Ticket      113572
Fare          80.0
Embarked       NaN
Name: 829, dtype: object

In [124]:
train_df.loc[829, 'Embarked'] = 'S'

In [125]:
train_df['Embarked'][train_df['Embarked'].isnull()]

Series([], Name: Embarked, dtype: object)

In [126]:
train_df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Embarked      0
dtype: int64

나이 결측치 행 제거

In [127]:
# 개인적으로 나이가 중요한 요소이지 않을까 하여, 좋은 데이터 질을 갖기 위해 나이가 nan인 데이터를 삭제하겠다.

train_df = train_df.dropna(axis=0)
train_df

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,female,35.0,1,0,113803,53.1000,S
4,0,3,male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,382652,29.1250,Q
886,0,2,male,27.0,0,0,211536,13.0000,S
887,1,1,female,19.0,0,0,112053,30.0000,S
889,1,1,male,26.0,0,0,111369,30.0000,C
890,0,3,male,32.0,0,0,370376,7.7500,Q

In [129]:
train_df.isnull().sum()
#결측치가 모두 사라진 모습. 데이터는 많이 줄었다.

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64